test/fixtures/filter_customers_200.json

{"@odata.context":"https://wiise.api.bc.dynamics.com/v1.0/cronus.com.au/api/v1.0/$metadata#companies(93b4dabd-da6b-416c-8f92-6c98a0e4d523)/customers","value":[{"@odata.etag":"W/\"JzQ0O1FQazdEcnhqUVR3VVloN2lDaDZQaXRLM0tkSStKYzVJUERvMzBMUE04b0U9MTswMDsn\"","id":"ee8fbd3d-5b83-4c7d-a4d2-4f704ca0c1e3","number":"30000","displayName":"School of Fine Art","type":"Company","phoneNumber":"","email":"meagan.bond@contoso.com","website":"","taxLiable":false,"taxAreaId":"3e8ab4f9-113d-4734-96ff-969bd7a3f313","taxAreaDisplayName":"Other customers and vendors (not MISC)","taxRegistrationNumber":"733495789","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"d42b10ec-e0f8-459d-8d84-4acb4423732b","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","lastModifiedDateTime":"2019-06-24T17:53:17.587Z","address":{"street":"10 High Tower","city":"Miami","state":"","countryLetterCode":"US","postalCode":"US-FL 37125"},"customerFinancialDetails":[{"@odata.etag":"W/\"JzQ0OzUrVklhaEt3QkJUUTdJS3JuZXY5bFJoQVREU25ROVZObjdrMzRQUXQ1ZGs9MTswMDsn\"","id":"ee8fbd3d-5b83-4c7d-a4d2-4f704ca0c1e3","number":"30000","balance":95193,"totalSalesExcludingTax":415914,"overdueAmount":95193}]},{"@odata.etag":"W/\"JzQ0O0pxY0M3bHltSlcyQlhVU2p3S3ZGMnZEZ2lDRjlyRVEwY04xNUhyYTAwU1E9MTswMDsn\"","id":"8790f0e2-28b8-408c-b62a-570ab255edd7","number":"20000","displayName":"Trey Research","type":"Company","phoneNumber":"","email":"mary.kumm@contoso.com","website":"","taxLiable":false,"taxAreaId":"5e96b48b-e330-4091-9146-e823ebac7e44","taxAreaDisplayName":"Domestic customers and vendors","taxRegistrationNumber":"254687456","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"d42b10ec-e0f8-459d-8d84-4acb4423732b","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","lastModifiedDateTime":"2019-06-24T17:53:17.517Z","address":{"street":"Southwark Bridge Rd, 91-95","city":"Perth","state":"WA","countryLetterCode":"AU","postalCode":"6800"},"customerFinancialDetails":[{"@odata.etag":"W/\"JzQ0OytUR1FuZ2tlWEJYOGlPeUJ1b0VNeEdRdXk4cDU1RDRuUWNZV0JpV3BnWmM9MTswMDsn\"","id":"8790f0e2-28b8-408c-b62a-570ab255edd7","number":"20000","balance":6296.25,"totalSalesExcludingTax":92567,"overdueAmount":6296.25}]},{"@odata.etag":"W/\"JzQ0OzFoRjFJWXBrenJITHFHTk95RFkrOFVlYWFuZDZzWmpTV1lDWHhXd0VmRWc9MTswMDsn\"","id":"8ea3e0c3-7fe4-4021-a5ef-5ce6eec86a67","number":"40000","displayName":"Alpine Ski House","type":"Company","phoneNumber":"","email":"ian.deberry@contoso.com","website":"","taxLiable":false,"taxAreaId":"3e8ab4f9-113d-4734-96ff-969bd7a3f313","taxAreaDisplayName":"Other customers and vendors (not MISC)","taxRegistrationNumber":"533435789","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"d42b10ec-e0f8-459d-8d84-4acb4423732b","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","lastModifiedDateTime":"2019-06-24T17:53:17.67Z","address":{"street":"Walter-Gropius-Strasse 5\r\nPark Stadt Schwabing","city":"Munchen","state":"","countryLetterCode":"DE","postalCode":"DE-80807"},"customerFinancialDetails":[{"@odata.etag":"W/\"JzQ0O042ejhIT3UyREFxVHZYUVROdjg4YW9qUi8xMkFXWUZoWm9wd3Z2Z3dvRzA9MTswMDsn\"","id":"8ea3e0c3-7fe4-4021-a5ef-5ce6eec86a67","number":"40000","balance":7635,"totalSalesExcludingTax":125491,"overdueAmount":7635}]},{"@odata.etag":"W/\"JzQ0O1FHdDhzWHpUaWxkU2pGNG5jd1c5dkRrY1JGSDhaMHIwVVB5MU1VMGdVUFE9MTswMDsn\"","id":"b450d7af-0de7-4ad6-9ae6-97d14b9e9a72","number":"10000","displayName":"Adatum Corporation","type":"Company","phoneNumber":"","email":"anthony.lording@contoso.com","website":"","taxLiable":false,"taxAreaId":"5e96b48b-e330-4091-9146-e823ebac7e44","taxAreaDisplayName":"Domestic customers and vendors","taxRegistrationNumber":"789456278","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"d42b10ec-e0f8-459d-8d84-4acb4423732b","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","lastModifiedDateTime":"2019-06-24T17:53:17.447Z","address":{"street":"Station Road, 21","city":"42000","state":"SA","countryLetterCode":"AU","postalCode":"5000"},"customerFinancialDetails":[{"@odata.etag":"W/\"JzQ0OzVFejNNY3RsNVdKM2RqNHdpU2VZczBmYkxlT3JMMHYrWVZrTHVHbzdBV0k9MTswMDsn\"","id":"b450d7af-0de7-4ad6-9ae6-97d14b9e9a72","number":"10000","balance":0,"totalSalesExcludingTax":405827,"overdueAmount":0}]},{"@odata.etag":"W/\"JzQ0O29DYWJUcWlKaUZVdCthK2tXbGRMbnZBcGRSOHQ4ck9icjViNFNZemdZc3c9MTswMDsn\"","id":"cf6cf1de-7340-4b6a-87a3-d7871193aa67","number":"50000","displayName":"Relecloud","type":"Company","phoneNumber":"","email":"mason.kingsley@contoso.com","website":"","taxLiable":false,"taxAreaId":"5e96b48b-e330-4091-9146-e823ebac7e44","taxAreaDisplayName":"Domestic customers and vendors","taxRegistrationNumber":"582048936","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"d42b10ec-e0f8-459d-8d84-4acb4423732b","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","lastModifiedDateTime":"2019-06-24T17:53:17.743Z","address":{"street":"Occam Court, 1\r\nSurrey","city":"Murdunna","state":"TAS","countryLetterCode":"AU","postalCode":"7178"},"customerFinancialDetails":[{"@odata.etag":"W/\"JzQ0O25DcjdJREZDQ0x6VEZ0enF5RGNZMmdCRVg2aEFrQ2NRcVRkbjZHNjIrV2M9MTswMDsn\"","id":"cf6cf1de-7340-4b6a-87a3-d7871193aa67","number":"50000","balance":18135.5,"totalSalesExcludingTax":158805,"overdueAmount":18135.5}]}]}