test/fixtures/get_customer_200.json

{"@odata.context":"https://wiise.api.bc.dynamics.com/v2.0/cronus.com.au/sandbox2/api/v2.0/$metadata#companies(67115559-c8b5-4880-b1d8-f85060892c37)/customers/$entity","@odata.etag":"W/\"JzQ0O0doSGV4OXI3WWN2QlZESTNaUDZtVC9iNld2TnRlU0NhcnUxclFZMWt4VHc9MTswMDsn\"","id":"9b847b20-4ddf-4131-b59a-0dca32e78c37","number":"40000","displayName":"Alpine Ski House","type":"Company","addressLine1":"Walter-Gropius-Strasse 5","addressLine2":"Park Stadt Schwabing","city":"Munchen","state":"","country":"DE","postalCode":"DE-80807","phoneNumber":"","email":"cronus@cronus.com.au","website":"","taxLiable":false,"taxAreaId":"e206a1c6-0af6-411d-92d4-8988483ed829","taxAreaDisplayName":"Other customers and vendors (not MISC)","taxRegistrationNumber":"533435789","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"fe2e91b2-728c-4c82-886f-1282629b03b5","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":"_x0020_","lastModifiedDateTime":"2018-12-04T18:19:44.837Z","customerFinancialDetail":{"@odata.etag":"W/\"JzQ0O3lMVlpFNHd4d1ZUWGNab09WL2Rqb2o4Q2ZDYjF0clJFUTRVVHZGQktkVzg9MTswMDsn\"","id":"9b847b20-4ddf-4131-b59a-0dca32e78c37","number":"40000","balance":7735,"totalSalesExcludingTax":125591,"overdueAmount":7735}}
