test/fixtures/get_customer_expanded_200.json

{"@odata.context":"https://wiise.api.bc.dynamics.com/v1.0/cronus.com.au/api/v1.0/$metadata#companies(93b4dabd-da6b-416c-8f92-6c98a0e4d523)/customers/$entity","@odata.etag":"W/\"JzQ0O1FQazdEcnhqUVR3VVloN2lDaDZQaXRLM0tkSStKYzVJUERvMzBMUE04b0U9MTswMDsn\"","id":"ee8fbd3d-5b83-4c7d-a4d2-4f704ca0c1e3","number":"30000","displayName":"School of Fine Art","type":"Company","phoneNumber":"","email":"meagan.bond@contoso.com","website":"","taxLiable":false,"taxAreaId":"3e8ab4f9-113d-4734-96ff-969bd7a3f313","taxAreaDisplayName":"Other customers and vendors (not MISC)","taxRegistrationNumber":"733495789","currencyId":"00000000-0000-0000-0000-000000000000","currencyCode":"AUD","paymentTermsId":"d42b10ec-e0f8-459d-8d84-4acb4423732b","shipmentMethodId":"00000000-0000-0000-0000-000000000000","paymentMethodId":"00000000-0000-0000-0000-000000000000","blocked":" ","lastModifiedDateTime":"2019-06-24T17:53:17.587Z","address":{"street":"10 High Tower","city":"Miami","state":"","countryLetterCode":"US","postalCode":"US-FL 37125"},"customerFinancialDetails":[{"@odata.etag":"W/\"JzQ0OzUrVklhaEt3QkJUUTdJS3JuZXY5bFJoQVREU25ROVZObjdrMzRQUXQ1ZGs9MTswMDsn\"","id":"ee8fbd3d-5b83-4c7d-a4d2-4f704ca0c1e3","number":"30000","balance":95193,"totalSalesExcludingTax":415914,"overdueAmount":95193}]}